<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    
    
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>operator.jsp</title>
</head>
<body>

	<h1>EL 연산자실습</h1>
	
	<hr>
	<h2>1. EL의 사칙연산자 연습</h2>
	<h2>\${3+5}  = ${ 3 + 5 }</h2>
	<h2>\${3-5}  = ${ 3 - 5 }</h2>
	<h2>\${3*5}  = ${ 3 * 5 }</h2>
	<h2>\${13/5} = ${ 13 / 5 }</h2>
	<h2>\${13%5} = ${ 13 % 5 }</h2>
	
	<hr>
	<h2>2. EL의 비교연산자 연습</h2>
	<h2>\${3==5} = ${ 3 == 5 }</h2>
	<h2>\${3>5}  = ${ 3 > 5 }</h2>
	<h2>\${3>=5} = ${ 3 >= 5}</h2>
	<h2>\${3&lt;5}  = ${ 3 < 5}</h2>
	<h2>\${3&lt;= 5} = ${ 3 <= 5}</h2>
	<h2>\${3!=5} = ${ 3 != 5}</h2>
	
	<hr>
	<h2>3. EL의 다양한 연산자로 복잡한 조건식 연습</h2>
	<h2>\${3!=5&&4==4} = ${ ( 3 != 5 ) && ( 4 == 4 ) }</h2>
	<h2>\${3!=5||4!=4} = ${ ( 3 != 5 ) || ( 4 != 4 ) }</h2>
	<h2>\${!(3==5)}    = ${ !( 3 == 5 ) }</h2>
	
</body>
</html>